In [4]:
# 270p line 10
import pandas as pd
import numpy as np
string_data = pd.Series(["a","b", np.nan,"d"])
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.isnull()

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
# na값을 전부 없애줌
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [16]:
#272ㅔ line 19
from numpy import nan as NA
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])

In [17]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
# 너무 다 없어짐
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
#
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#NaN값을 다 소거하면 남는 데이터가 없으니 
#threshold 를 사용 (문턱값)
#직접 인수를 설정하던지 아니면 A.I가 자동으로

In [25]:
# 275p line 35 
df2 = df.fillna(0)
df2
_ = df.fillna(0, inplace=True) #원본의 NA가 0대체 즉 새로운 df를 안 만듦

NameError: name 'df' is not defined

In [ ]:
# p276 표7-2
# method ffill 
# line 40

In [26]:
dic_data = {"k1":['one', 'two', 'one', 'two', 'one', 'two', 'two',],
           "k2":[1, 1, 2, 3, 4, 4, 4]}
data = pd.DataFrame(dic_data)
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   4
6  two   4

In [27]:
#중복확인
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [28]:
# 중복된거 없애기
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   4
5  two   4

In [31]:
#컬럼추가
data['v1'] = [0,1,2,3,4,5,6]
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
5  two   4   5
6  two   4   6

In [32]:
#
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [33]:
#첫
data.drop_duplicates(['k1','k2'], keep ='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   4   4
6  two   4   6